#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
github_actions_secret.gh_secret_aws_secret_access_key: Refreshing state... [id=devops-challange:AWS_SECRET_ACCESS_KEY]
github_actions_secret.gh_secret_aws_region: Refreshing state... [id=devops-challange:AWS_REGION]
github_actions_secret.gh_secret_aws_access_key_id: Refreshing state... [id=devops-challange:AWS_ACCESS_KEY_ID]
module.eks_blueprints.data.aws_region.current: Reading...
module.eks_blueprints_kubernetes_addons.data.aws_partition.current: Reading...
module.eks_blueprints_kubernetes_addons.data.aws_region.current: Reading...
data.aws_caller_identity.current: Reading...
module.iam_group_with_policies.data.aws_partition.current: Reading...
module.eks_blueprints_kubernetes_addons.data.aws_caller_identity.current: Reading...
module.eks_blueprints.data.aws_caller_identity.current: Reading...
data.aws_availability_zones.available: Reading...
module.iam_group_with_policies.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks_blueprints_kubernetes_addons.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks_blueprints.data.aws_region.current: Read complete after 0s [id=us-west-2]
module.eks_blueprints_kubernetes_addons.data.aws_region.current: Read complete after 0s [id=us-west-2]
module.iam_user.aws_iam_user.this[0]: Refreshing state... [id=gh_actions_user]
module.iam_group_with_policies.data.aws_caller_identity.current[0]: Reading...
aws_ecr_repository.app_repository_image: Refreshing state... [id=comments-app]
module.iam_group_with_policies.aws_iam_group.this[0]: Refreshing state... [id=github-actions]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-03197104d843b6051]
module.eks_blueprints.module.aws_eks.data.aws_partition.current: Reading...
module.eks_blueprints.module.aws_eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks_blueprints.data.aws_partition.current: Reading...
module.eks_blueprints.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks_blueprints.module.aws_eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks_blueprints.module.aws_eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks_blueprints.module.aws_eks.aws_iam_role.this[0]: Refreshing state... [id=devops-challange-cluster-role]
module.eks_blueprints.data.aws_caller_identity.current: Read complete after 0s [id=680080015686]
data.aws_caller_identity.current: Read complete after 0s [id=680080015686]
module.eks_blueprints_kubernetes_addons.data.aws_caller_identity.current: Read complete after 0s [id=680080015686]
module.eks_blueprints.data.aws_iam_session_context.current: Reading...
module.eks_blueprints.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:iam::680080015686:user/daniel.oliveira]
module.iam_group_with_policies.data.aws_caller_identity.current[0]: Read complete after 0s [id=680080015686]
module.iam_group_with_policies.data.aws_iam_policy_document.iam_self_management: Reading...
module.eks_blueprints.data.aws_iam_policy_document.eks_key: Reading...
module.iam_group_with_policies.data.aws_iam_policy_document.iam_self_management: Read complete after 0s [id=2343929085]
module.iam_group_with_policies.aws_iam_policy.iam_self_management[0]: Refreshing state... [id=arn:aws:iam::680080015686:policy/IAMSelfManagement-20220629173201139200000001]
module.eks_blueprints.data.aws_iam_policy_document.eks_key: Read complete after 0s [id=2251465149]
module.eks_blueprints.module.kms[0].aws_kms_key.this: Refreshing state... [id=d686ecc6-78f5-4a56-850a-c182a5154f0c]
data.aws_availability_zones.available: Read complete after 1s [id=us-west-2]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0031633ec4b91a2e3]
module.iam_group_with_policies.aws_iam_group_membership.this[0]: Refreshing state... [id=github-actions]
module.iam_user.aws_iam_access_key.this_no_pgp[0]: Refreshing state... [id=AKIAZ4V7NQFDGSKYGNDC]
module.iam_group_with_policies.aws_iam_group_policy_attachment.iam_self_management[0]: Refreshing state... [id=github-actions-20220629173202233200000002]
data.aws_ecr_repository.service: Reading...
module.eks_blueprints.module.aws_eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"]: Refreshing state... [id=devops-challange-cluster-role-20220629164239925300000003]
module.eks_blueprints.module.aws_eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"]: Refreshing state... [id=devops-challange-cluster-role-20220629164240104000000004]
module.eks_blueprints.module.kms[0].aws_kms_alias.this: Refreshing state... [id=alias/devops-challange]
data.aws_ecr_repository.service: Read complete after 0s [id=comments-app]
module.iam_policy.aws_iam_policy.policy[0]: Refreshing state... [id=arn:aws:iam::680080015686:policy/github-ecr-policy]
github_actions_secret.gh_secret_ecr_repository: Refreshing state... [id=devops-challange:ECR_REPOSITORY]
module.iam_group_with_policies.aws_iam_group_policy_attachment.custom_arns[0]: Refreshing state... [id=github-actions-20220629173203716500000003]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-04c2306acb811d6bd]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-08d08b542627ebcb1]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0ff193f2a8f0d7df5]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-03321a8b489f62305]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0e020be6db7bcb200]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-02b77f3c1152089ea]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-02b20e4c2b74ed4ce]
module.eks_blueprints.module.aws_eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0032217115f9e4b5d]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0ad2aab81fcd30329]
module.eks_blueprints.module.aws_eks.aws_security_group.node[0]: Refreshing state... [id=sg-04704544e5bad11b5]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0d6eb8f55c6dae02e]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0e020be6db7bcb2001080289494]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0505f42f2f49af2ae]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-095b460f2baaf85b9]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0ebb1fa290d42169c]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-022dff015b367284a]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-088000615df71a84f]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0e6860c24bbcd2e29]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0e0ec1e718234285c]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["egress_ntp_tcp"]: Refreshing state... [id=sgrule-1956301794]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["egress_ntp_udp"]: Refreshing state... [id=sgrule-168095471]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["egress_self_coredns_tcp"]: Refreshing state... [id=sgrule-367812654]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["egress_self_coredns_udp"]: Refreshing state... [id=sgrule-2609635912]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-3337138196]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-1373679026]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-1528751156]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["egress_https"]: Refreshing state... [id=sgrule-2873423612]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["egress_cluster_443"]: Refreshing state... [id=sgrule-4205253091]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-1656165371]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.cluster["egress_nodes_443"]: Refreshing state... [id=sgrule-2632008678]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.cluster["egress_nodes_kubelet"]: Refreshing state... [id=sgrule-1841120709]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-4152448090]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-02b20e4c2b74ed4ce1080289494]
module.eks_blueprints.module.aws_eks.aws_eks_cluster.this[0]: Refreshing state... [id=devops-challange]
module.eks_blueprints_kubernetes_addons.module.opentelemetry_operator[0].data.aws_eks_addon_version.this[0]: Reading...
module.eks_blueprints.data.aws_eks_cluster.cluster[0]: Reading...
data.aws_eks_cluster.cluster: Reading...
github_actions_secret.gh_secret_eks_cluster_name: Refreshing state... [id=devops-challange:EKS_CLUSTER_NAME]
data.aws_eks_cluster_auth.cluster: Reading...
data.aws_eks_cluster_auth.cluster: Read complete after 0s [id=devops-challange]
module.eks_blueprints.module.aws_eks.data.tls_certificate.this[0]: Reading...
data.aws_eks_cluster.cluster: Read complete after 0s [id=devops-challange]
module.eks_blueprints.data.aws_eks_cluster.cluster[0]: Read complete after 0s [id=devops-challange]
module.eks_blueprints.data.http.eks_cluster_readiness[0]: Reading...
github_actions_secret.gh_secret_kube_config_data: Refreshing state... [id=devops-challange:KUBE_CONFIG_DATA]
module.eks_blueprints_kubernetes_addons.data.aws_eks_cluster.eks_cluster: Reading...
module.eks_blueprints_kubernetes_addons.module.opentelemetry_operator[0].data.aws_eks_addon_version.this[0]: Read complete after 0s [id=adot]
module.eks_blueprints.module.aws_eks.data.tls_certificate.this[0]: Read complete after 0s [id=64f4090f1ce5e41f5adb6ee379e80f74c3f0d039]
module.eks_blueprints.module.aws_eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::680080015686:oidc-provider/oidc.eks.us-west-2.amazonaws.com/id/E4750255FC0356177864DC127BAFF46D]
module.eks_blueprints_kubernetes_addons.module.ingress_nginx[0].kubernetes_namespace_v1.this: Refreshing state... [id=ingress-nginx]
module.eks_blueprints_kubernetes_addons.module.opentelemetry_operator[0].kubernetes_namespace_v1.adot[0]: Refreshing state... [id=opentelemetry-operator-system]
module.eks_blueprints_kubernetes_addons.module.opentelemetry_operator[0].kubernetes_cluster_role_binding_v1.adot[0]: Refreshing state... [id=eks:addon-manager-otel]
module.eks_blueprints_kubernetes_addons.data.aws_eks_cluster.eks_cluster: Read complete after 0s [id=devops-challange]
module.eks_blueprints_kubernetes_addons.module.cluster_autoscaler[0].data.aws_iam_policy_document.cluster_autoscaler: Reading...
module.eks_blueprints_kubernetes_addons.module.cluster_autoscaler[0].data.aws_iam_policy_document.cluster_autoscaler: Read complete after 0s [id=765862695]
module.eks_blueprints_kubernetes_addons.module.aws_kube_proxy[0].aws_eks_addon.kube_proxy: Refreshing state... [id=devops-challange:kube-proxy]
module.eks_blueprints_kubernetes_addons.module.cluster_autoscaler[0].aws_iam_policy.cluster_autoscaler: Refreshing state... [id=arn:aws:iam::680080015686:policy/devops-challange-cluster-autoscaler-irsa]
module.eks_blueprints_kubernetes_addons.module.aws_load_balancer_controller[0].data.aws_iam_policy_document.aws_lb: Reading...
module.eks_blueprints_kubernetes_addons.module.aws_vpc_cni[0].module.irsa_addon[0].aws_iam_role.irsa[0]: Refreshing state... [id=devops-challange-aws-node-irsa]
module.eks_blueprints_kubernetes_addons.module.opentelemetry_operator[0].module.cert_manager.data.aws_iam_policy_document.cert_manager_iam_policy_document: Reading...
module.eks_blueprints_kubernetes_addons.module.opentelemetry_operator[0].module.cert_manager.data.aws_iam_policy_document.cert_manager_iam_policy_document: Read complete after 0s [id=2873133587]
module.eks_blueprints_kubernetes_addons.module.metrics_server[0].module.helm_addon.helm_release.addon[0]: Refreshing state... [id=metrics-server]
module.eks_blueprints_kubernetes_addons.module.opentelemetry_operator[0].module.cert_manager.aws_iam_policy.cert_manager: Refreshing state... [id=arn:aws:iam::680080015686:policy/devops-challange-cert-manager-irsa]
module.eks_blueprints_kubernetes_addons.module.aws_load_balancer_controller[0].data.aws_iam_policy_document.aws_lb: Read complete after 0s [id=304567098]
module.eks_blueprints_kubernetes_addons.module.aws_coredns[0].data.aws_eks_addon_version.this: Reading...
module.eks_blueprints_kubernetes_addons.module.aws_load_balancer_controller[0].aws_iam_policy.aws_load_balancer_controller: Refreshing state... [id=arn:aws:iam::680080015686:policy/devops-challange-lb-irsa]
module.eks_blueprints_kubernetes_addons.module.cluster_autoscaler[0].module.helm_addon.module.irsa[0].aws_iam_role.irsa[0]: Refreshing state... [id=devops-challange-cluster-autoscaler-sa-irsa]
module.eks_blueprints.data.http.eks_cluster_readiness[0]: Read complete after 1s [id=https://E4750255FC0356177864DC127BAFF46D.gr7.us-west-2.eks.amazonaws.com/healthz]
module.eks_blueprints.kubernetes_config_map.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
module.eks_blueprints_kubernetes_addons.module.opentelemetry_operator[0].module.cert_manager.module.helm_addon.module.irsa[0].aws_iam_role.irsa[0]: Refreshing state... [id=devops-challange-cert-manager-irsa]
module.eks_blueprints_kubernetes_addons.module.opentelemetry_operator[0].module.cert_manager.module.helm_addon.module.irsa[0].kubernetes_namespace_v1.irsa[0]: Refreshing state... [id=cert-manager]
module.eks_blueprints_kubernetes_addons.module.aws_coredns[0].data.aws_eks_addon_version.this: Read complete after 1s [id=coredns]
module.eks_blueprints_kubernetes_addons.module.aws_coredns[0].aws_eks_addon.coredns[0]: Refreshing state... [id=devops-challange:coredns]
module.eks_blueprints_kubernetes_addons.module.aws_vpc_cni[0].module.irsa_addon[0].aws_iam_role_policy_attachment.irsa[0]: Refreshing state... [id=devops-challange-aws-node-irsa-20220629171502530100000004]
module.eks_blueprints_kubernetes_addons.module.aws_load_balancer_controller[0].module.helm_addon.module.irsa[0].aws_iam_role.irsa[0]: Refreshing state... [id=devops-challange-aws-load-balancer-controller-sa-irsa]
module.eks_blueprints_kubernetes_addons.module.aws_vpc_cni[0].aws_eks_addon.vpc_cni: Refreshing state... [id=devops-challange:vpc-cni]
module.eks_blueprints_kubernetes_addons.module.cluster_autoscaler[0].module.helm_addon.module.irsa[0].aws_iam_role_policy_attachment.irsa[0]: Refreshing state... [id=devops-challange-cluster-autoscaler-sa-irsa-20220629171503204200000005]
module.eks_blueprints_kubernetes_addons.module.opentelemetry_operator[0].kubernetes_role_v1.adot[0]: Refreshing state... [id=opentelemetry-operator-system/eks:addon-manager]
module.eks_blueprints_kubernetes_addons.module.opentelemetry_operator[0].kubernetes_role_binding_v1.adot[0]: Refreshing state... [id=opentelemetry-operator-system/eks:addon-manager]
module.eks_blueprints_kubernetes_addons.module.cluster_autoscaler[0].module.helm_addon.module.irsa[0].kubernetes_service_account_v1.irsa[0]: Refreshing state... [id=kube-system/cluster-autoscaler-sa]
module.eks_blueprints_kubernetes_addons.module.ingress_nginx[0].module.helm_addon.helm_release.addon[0]: Refreshing state... [id=ingress-nginx]
module.eks_blueprints_kubernetes_addons.module.opentelemetry_operator[0].kubernetes_cluster_role_v1.adot[0]: Refreshing state... [id=eks:addon-manager-otel]
module.eks_blueprints.module.aws_eks_managed_node_groups["mg_t3"].data.aws_iam_policy_document.managed_ng_assume_role_policy: Reading...
module.eks_blueprints.module.aws_eks_managed_node_groups["mg_t3"].data.aws_iam_policy_document.managed_ng_assume_role_policy: Read complete after 0s [id=3778018924]
module.eks_blueprints.module.aws_eks_managed_node_groups["mg_t3"].aws_iam_role.managed_ng[0]: Refreshing state... [id=devops-challange-managed-ondemand]
module.eks_blueprints_kubernetes_addons.module.opentelemetry_operator[0].module.cert_manager.module.helm_addon.module.irsa[0].aws_iam_role_policy_attachment.irsa[0]: Refreshing state... [id=devops-challange-cert-manager-irsa-20220629171503243100000006]
module.eks_blueprints_kubernetes_addons.module.opentelemetry_operator[0].module.cert_manager.module.helm_addon.module.irsa[0].kubernetes_service_account_v1.irsa[0]: Refreshing state... [id=cert-manager/cert-manager]
module.eks_blueprints_kubernetes_addons.module.cluster_autoscaler[0].module.helm_addon.helm_release.addon[0]: Refreshing state... [id=cluster-autoscaler]
module.eks_blueprints_kubernetes_addons.module.opentelemetry_operator[0].module.cert_manager.module.helm_addon.helm_release.addon[0]: Refreshing state... [id=cert-manager]
module.eks_blueprints_kubernetes_addons.module.aws_load_balancer_controller[0].module.helm_addon.module.irsa[0].aws_iam_role_policy_attachment.irsa[0]: Refreshing state... [id=devops-challange-aws-load-balancer-controller-sa-irsa-20220629171503985000000007]
module.eks_blueprints_kubernetes_addons.module.aws_load_balancer_controller[0].module.helm_addon.module.irsa[0].kubernetes_service_account_v1.irsa[0]: Refreshing state... [id=kube-system/aws-load-balancer-controller-sa]
module.eks_blueprints_kubernetes_addons.module.aws_load_balancer_controller[0].module.helm_addon.helm_release.addon[0]: Refreshing state... [id=aws-load-balancer-controller]
module.eks_blueprints.module.aws_eks_managed_node_groups["mg_t3"].aws_iam_role_policy_attachment.managed_ng["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=devops-challange-managed-ondemand-20220629165249640500000006]
module.eks_blueprints.module.aws_eks_managed_node_groups["mg_t3"].aws_iam_role_policy_attachment.managed_ng["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=devops-challange-managed-ondemand-20220629165250020600000008]
module.eks_blueprints.module.aws_eks_managed_node_groups["mg_t3"].aws_iam_role_policy_attachment.managed_ng["arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"]: Refreshing state... [id=devops-challange-managed-ondemand-20220629165249979600000007]
module.eks_blueprints.module.aws_eks_managed_node_groups["mg_t3"].aws_iam_role_policy_attachment.managed_ng["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=devops-challange-managed-ondemand-20220629165249455100000005]
module.eks_blueprints.module.aws_eks_managed_node_groups["mg_t3"].aws_iam_instance_profile.managed_ng[0]: Refreshing state... [id=devops-challange-managed-ondemand]
module.eks_blueprints.module.aws_eks_managed_node_groups["mg_t3"].aws_eks_node_group.managed_ng: Refreshing state... [id=devops-challange:managed-ondemand-20220629165250214100000009]
module.eks_blueprints_kubernetes_addons.module.opentelemetry_operator[0].module.cert_manager.helm_release.cert_manager_ca[0]: Refreshing state... [id=cert-manager-ca]
module.eks_blueprints_kubernetes_addons.module.opentelemetry_operator[0].module.cert_manager.helm_release.cert_manager_letsencrypt[0]: Refreshing state... [id=cert-manager-letsencrypt]
module.eks_blueprints_kubernetes_addons.module.opentelemetry_operator[0].aws_eks_addon.adot[0]: Refreshing state... [id=devops-challange:adot]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_actions_secret.gh_secret_aws_access_key_id will be created
  + resource "github_actions_secret" "gh_secret_aws_access_key_id" {
      + created_at  = (known after apply)
      + id          = (known after apply)
      + secret_name = "AWS_ACCESS_KEY_ID"
      + updated_at  = (known after apply)
    }

  # github_actions_secret.gh_secret_aws_region will be created
  + resource "github_actions_secret" "gh_secret_aws_region" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + secret_name     = "AWS_REGION"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.gh_secret_aws_secret_access_key will be created
  + resource "github_actions_secret" "gh_secret_aws_secret_access_key" {
      + created_at  = (known after apply)
      + id          = (known after apply)
      + secret_name = "AWS_SECRET_ACCESS_KEY"
      + updated_at  = (known after apply)
    }

  # github_actions_secret.gh_secret_ecr_repository will be created
  + resource "github_actions_secret" "gh_secret_ecr_repository" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + secret_name     = "ECR_REPOSITORY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.gh_secret_eks_cluster_name will be created
  + resource "github_actions_secret" "gh_secret_eks_cluster_name" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + secret_name     = "EKS_CLUSTER_NAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.gh_secret_kube_config_data will be created
  + resource "github_actions_secret" "gh_secret_kube_config_data" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + secret_name     = "KUBE_CONFIG_DATA"
      + updated_at      = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Warning: Redundant ignore_changes element

  on .terraform/modules/eks_blueprints.aws_eks/main.tf line 298, in resource "aws_eks_addon" "this":
 298: resource "aws_eks_addon" "this" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute modified_at is decided by the provider alone and therefore
there can be no configured value to compare with. Including this attribute in
ignore_changes has no effect. Remove the attribute from ignore_changes to
quiet this warning.

Warning: Experimental feature "module_variable_optional_attrs" is active

  on .terraform/modules/eks_blueprints_kubernetes_addons.ondat/locals.tf line 2, in terraform:
   2:   experiments = [module_variable_optional_attrs]

Experimental features are subject to breaking changes in future minor or
patch releases, based on feedback.

If you have feedback on the design of this feature, please open a GitHub
issue to discuss it.

(and 76 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @danielOliveira97, Action: `pull_request`*